---
kind: property
id: P:Autodesk.Revit.UI.Events.CommandEventArgs.ActiveDocument
source: html/c9769a52-5a67-3f36-e10c-676617376366.htm
---
# Autodesk.Revit.UI.Events.CommandEventArgs.ActiveDocument Property

The active document.

## Syntax (C#)
```csharp
public Document ActiveDocument { get; }
```